trison200/STM32LAB1/STM32PROJECT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define num0_Pin GPIO_PIN_4
#define num0_GPIO_Port GPIOA
#define num1_Pin GPIO_PIN_5
#define num1_GPIO_Port GPIOA
#define num2_Pin GPIO_PIN_6
#define num2_GPIO_Port GPIOA
#define num3_Pin GPIO_PIN_7
#define num3_GPIO_Port GPIOA
#define num4_Pin GPIO_PIN_8
#define num4_GPIO_Port GPIOA
#define num5_Pin GPIO_PIN_9
#define num5_GPIO_Port GPIOA
#define num6_Pin GPIO_PIN_10
#define num6_GPIO_Port GPIOA
#define num7_Pin GPIO_PIN_11
#define num7_GPIO_Port GPIOA
#define num8_Pin GPIO_PIN_12
#define num8_GPIO_Port GPIOA
#define num9_Pin GPIO_PIN_13
#define num9_GPIO_Port GPIOA
#define num10_Pin GPIO_PIN_14
#define num10_GPIO_Port GPIOA
#define num11_Pin GPIO_PIN_15
#define num11_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
